{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"embedding_14_input": {"name": "embedding_14_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"dense_14": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "39"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "39"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "39"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "39"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/embedding_14/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "embedding_14_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack-folded-0"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack-folded-1"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/embedding_14/Cast", "op": "Cast", "input": ["embedding_14_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_74"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_75"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_76"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_77"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_22", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_69"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_20", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_67"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_3/embedding_14/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential_3/embedding_14/Cast", "StatefulPartitionedCall/sequential_3/embedding_14/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/embedding_14/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_3/embedding_14/embedding_lookup", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/gru_12/Shape", "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack", "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_3/gru_12/strided_slice", "StatefulPartitionedCall/sequential_3/gru_12/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_3/gru_12/zeros/packed", "StatefulPartitionedCall/sequential_3/gru_12/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_26", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_73"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8zL2dydV8xMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_25", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_72"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_24", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_71"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/enter/_23", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_70"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/cond/_18/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_33", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_36", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_31"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/cond/_18/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_49", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_37", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_11_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_10_switch/_47", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_35", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_12_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/time_switch/_45", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_33", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_counter_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_31", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1_switch/_46", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_34", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/LoopCond/_42"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_counter_switch/_43:1"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/exit/_58", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1_switch/_46"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/sub/x", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_73", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_49:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_11_switch/_50:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack_switch/_51:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split_1/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_12_switch/_52:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_10_switch/_47:1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_12_switch/_52:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "grad_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack_switch/_53:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/input/_94", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/time_switch/_45:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_4/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_5/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice_switch/_48:1", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/exit/_58", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/BiasAdd_1", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/MatMul_1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack_switch/_53:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_49:1", "Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/input/_94", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_4", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/input/_94", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_4/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_counter_switch/_43:1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_5/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split_1", "op": "Split", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split_1/split_dim", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "3"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_11_switch/_50:1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack_switch/_51:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_69", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_4", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_67", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_5", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split/split_dim", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/BiasAdd"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Shape", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/axes", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Shape", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/free", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split:1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2_1", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const_2", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Prod", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/Sigmoid", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/input/_10_switch/_47:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/sub", "op": "Sub", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/sub/x", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/Sigmoid_1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split_1:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose_1", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split:2", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Reshape", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "grad_b": {"b": false}, "grad_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot/MatMul", "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/sub", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Tensordot", "StatefulPartitionedCall/sequential_3/dense_14/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/mul_1", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_3/dense_14/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_71", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_3", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1_switch/_46:1", "Func/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/input/_94", "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_3"], "attr": {"resize_if_index_out_of_bounds": {"b": false}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/dense_14/Softmax", "^StatefulPartitionedCall/sequential_3/embedding_14/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/next_iteration/_70", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_body_control/_54"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/ReadVariableOp", "shape": [128, 39], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/Read/ReadVariableOp", "shape": [16, 384], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack-folded-0", "shape": [384], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/Read_1/ReadVariableOp", "shape": [128, 384], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/unstack-folded-1", "shape": [384], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_14/BiasAdd/ReadVariableOp", "shape": [39], "dtype": "float32"}, {"name": "unknown", "shape": [39, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/embedding_14/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/sub/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/split_1/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_4/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/gru_12/PartitionedCall/while/body/_19/while/add_5/y", "shape": [], "dtype": "int32"}]}]}